src/DataProcessors/ЗагрузкаКорневыхХарактеристик/ЗагрузкаКорневыхХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКорневыхХарактеристик</name>
</mdclass:DataProcessor>

src/InformationRegisters/КорневыеХарактеристики/КорневыеХарактеристики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КорневыеХарактеристики</name>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрМатериала</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыМатериалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/ChartsOfCharacteristicTypes/ПараметрыМатериалов/ПараметрыМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПараметрыМатериалов</name>
  <type>
    <types>CatalogRef.ВидыКорпусов</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>400</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолнНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Многострочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроверки</name>
    <type>
      <types>EnumRef.УсловияПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>Условие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрещенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/DataProcessors/ЗагрузкаКорневыхХарактеристик/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Спецификация.ЭтоГруппа Тогда
	Спецификация = Параметры.Спецификация;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНормуРасходов(ЭтапСпецификации,Позиция)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
			Если СокрЛП(ВыборкаНР.Позиция) = Позиция Тогда
			Возврат(ВыборкаНР.Ссылка);
			КонецЕсли; 
		Иначе
			Если ВыборкаНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
			Элемент = ПолучитьНормуРасходов(ВыборкаНР.Элемент,Позиция);
				Если ТипЗнч(Элемент) = Тип("СправочникСсылка.НормыРасходов") Тогда
				Возврат(Элемент);
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
Возврат(Справочники.НормыРасходов.ПустаяСсылка());
КонецФункции 

&НаСервере
Функция ПолучитьПараметр(НаименованиеПараметра)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыМатериалов КАК ПараметрыМатериалов
	|ГДЕ
	|	ПараметрыМатериалов.Наименование ПОДОБНО &Наименование
	|	И ПараметрыМатериалов.Запрещенный = ЛОЖЬ
	|	И ПараметрыМатериалов.РучнаяПроверка = ИСТИНА";
Запрос.УстановитьПараметр("Наименование", НаименованиеПараметра);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(ПланыВидовХарактеристик.ПараметрыМатериалов.ПустаяСсылка());
КонецФункции 

&НаСервере
Процедура ПолучитьПараметрыШаблона(ВидМатериала,ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПараметровМатериалов.ПараметрМатериала КАК ПараметрМатериала
	|ИЗ
	|	Справочник.ШаблоныПараметровМатериалов КАК ШаблоныПараметровМатериалов
	|ГДЕ
	|	ШаблоныПараметровМатериалов.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", ВидМатериала);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_П = ТЧ.Параметры.Добавить();
	ТЧ_П.Наименование = ВыборкаДетальныеЗаписи.ПараметрМатериала.Наименование;
	ТЧ_П.Параметр = ВыборкаДетальныеЗаписи.ПараметрМатериала;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(НР,НаименованиеПозиции,ID_template,НаименованиеПараметра,Значение1,Значение2)
Выборка = ТаблицаПараметров.НайтиСтроки(Новый Структура("НормаРасходов",НР));
	Если Выборка.Количество() = 0 Тогда
	ТЧ = ТаблицаПараметров.Добавить();
	ТЧ.Позиция = НР.Позиция;
	ТЧ.НаименованиеПозиции = НаименованиеПозиции;
	ТЧ.НормаРасходов = НР;
	ТЧ.ВидМатериала = НР.Элемент.ВидМатериала;
	ТЧ.ID_template = ID_template;
		Если ЗначениеЗаполнено(НР) Тогда
			Если ЗначениеЗаполнено(НР.Элемент.ВидМатериала) Тогда
			ПолучитьПараметрыШаблона(НР.Элемент.ВидМатериала,ТЧ);
			КонецЕсли;
		КонецЕсли; 
	Иначе
	ТЧ = Выборка[0];
	КонецЕсли;
Выборка = ТЧ.Параметры.НайтиСтроки(Новый Структура("Наименование",НаименованиеПараметра));
	Если Выборка.Количество() = 0 Тогда
	ТЧ_П = ТЧ.Параметры.Добавить();
	ТЧ_П.НаименованиеИзФайла = НаименованиеПараметра;
	ТЧ_П.Параметр = ПолучитьПараметр(НаименованиеПараметра);
	Иначе
	ТЧ_П = Выборка[0];
    ТЧ_П.НаименованиеИзФайла = НаименованиеПараметра;
	КонецЕсли;
сообщить(Значение1);
		Если ЗначениеЗаполнено(ТЧ_П.Параметр) Тогда
			Если Строка(ТЧ_П.Параметр.ТипЗначения) = "Число" Тогда
			ТЧ_П.Значение1 = ?(ЗначениеЗаполнено(Значение1),Число(Значение1),0);
			ТЧ_П.Значение2 = ?(ЗначениеЗаполнено(Значение2),Число(Значение2),0);
			ИначеЕсли Строка(ТЧ_П.Параметр.ТипЗначения) = "Виды корпусов" Тогда
			ТЧ_П.Значение1 = Справочники.ВидыКорпусов.НайтиПоНаименованию(Значение1,Истина);
			Иначе	
			ТЧ_П.Значение1 = Значение1;
			ТЧ_П.Значение2 = Значение2;	
			КонецЕсли;
		Иначе
		ТЧ_П.Значение1 = Значение1;
		ТЧ_П.Значение2 = Значение2;	
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами материалов");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	ID_template = "";
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка параметров материалов...");
			Если ЗначениеЗаполнено(СокрЛП(ExcelЛист.Cells(к,1).Value)) Тогда
			НаименованиеПозиции = СокрЛП(ExcelЛист.Cells(к,1).Value);
			НР = ПолучитьНормуРасходов(Спецификация,СокрЛП(ExcelЛист.Cells(к,1).Value));
			Иначе
				Если СокрЛП(ExcelЛист.Cells(к,2).Value) = "ID_template" Тогда
				ID_template = СокрЛП(ExcelЛист.Cells(к,3).Value);
				Иначе
				ЗагрузитьНаСервере(НР,НаименованиеПозиции,ID_template,СокрЛП(ExcelЛист.Cells(к,2).Value),СокрЛП(ExcelЛист.Cells(к,3).Value),СокрЛП(ExcelЛист.Cells(к,4).Value));						
				КонецЕсли; 
			КонецЕсли;
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьКорневыеХарактеристики(ЭтапСпецификации)
//НаборЗаписей = РегистрыСведений.КорневыеХарактеристики.СоздатьНаборЗаписей();
//НаборЗаписей.Отбор.Спецификация.Установить(ЭтапСпецификации);
//НаборЗаписей.Записать();

//Запрос = Новый Запрос;

//Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	НормыРасходов.Элемент КАК Элемент
//	|ИЗ
//	|	Справочник.НормыРасходов КАК НормыРасходов
//	|ГДЕ
//	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
//	|	И НормыРасходов.Владелец = &Владелец
//	|	И НормыРасходов.ВидЭлемента = &ВидЭлемента";
//Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
//Запрос.УстановитьПараметр("ВидЭлемента", Перечисления.ВидыЭлементовНормРасходов.Основа);
//РезультатЗапроса = Запрос.Выполнить();
//ВыборкаНР = РезультатЗапроса.Выбрать();
//	Пока ВыборкаНР.Следующий() Цикл
//	ОчиститьКорневыеХарактеристики(ВыборкаНР.Элемент);
//	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСпецификациюНаСервере()
НаборЗаписей = РегистрыСведений.КорневыеХарактеристики.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.Спецификация.Установить(Спецификация);
НаборЗаписей.Записать();
	Для каждого ТЧ Из ТаблицаПараметров Цикл
		Если ЗначениеЗаполнено(ТЧ.НормаРасходов) Тогда
			Если ЗначениеЗаполнено(ТЧ.ВидМатериала) Тогда
				Для каждого ТЧ_П Из ТЧ.Параметры Цикл	
					Если ЗначениеЗаполнено(ТЧ_П.Параметр) Тогда
						Если ЗначениеЗаполнено(ТЧ_П.Значение1) Тогда
						ПМ = РегистрыСведений.КорневыеХарактеристики.СоздатьМенеджерЗаписи();
						ПМ.Спецификация = Спецификация;
						ПМ.НормаРасходов = ТЧ.НормаРасходов;
						ПМ.ПараметрМатериала = ТЧ_П.Параметр;
						ПМ.Значение1 = ТЧ_П.Значение1;
						ПМ.Значение2 = ТЧ_П.Значение2;
						ПМ.Записать(Истина);					
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСпецификацию(Команда)
//ОчиститьКорневыеХарактеристики(Спецификация);
ДобавитьВСпецификациюНаСервере();
КонецПроцедуры
